#+title: pill

Pill is a simple job scheduler. It can be used as a replacement for
cron or systemd timers in many cases, but it is not as feature-rich
(i.e. no dependency resolution). But it /has/ a REST api, a basic
command line interface and it can send job output via mail.

I created it, because I wanted something easier to use than cron or
systemd timers. Sometimes (like on my NAS) there is not even cron (or
rather its version is [[http://jimmybonney.com/articles/manage_crontab_synology/][incredibly hard]] to use…).

Example: run ~scrape-site.sh~ each tuesday at 11:00 and 15:00 and
mail the output to ~me@test.com~:

#+BEGIN_EXAMPLE
bash> pill new -t 'Tue *-*-* 11,15:00' -m 'me@test.com' ./scrape-site.sh arg1 arg2
#+END_EXAMPLE

The master server is started if not running already. Then the new job
is submitted and runs then periodically.

The timer syntax is a subset of those systemd uses: Think of a date
like =Mon 2016-10-12 14:35= and replace all parts that should always
match with a =*= (except weekdays, don't name them if they don't
matter). Seconds are not possible. Jobs can run at most once a
minute. Multiple values are separated by a comma.

~-m~ mails output to given email. To only see error, use ~-em~. The
output is stored unless option ~--silent~ is given.

** Show some help

#+begin_src shell :exports both :results verbatim
pill help
#+end_src

#+RESULTS:
#+begin_example
pill v0.0.1-SNAPSHOT (dirty workingdir @ master/4919e5541) at 2016-11-19T23:57:37.220Z

… a simple job scheduler. It will execute your scripts periodically.
It is controlled via REST and a basic command line interface is provided.

Commands:
- change: Change properties of a scheduled job
- clean-runs: Free disk space by removing old runs
- info: Show some info about the master scheduler
- last: Show details about last run
- list: List all scheduled jobs
- new: Schedule a new job
- pause: Pause the master scheduler
- rm: Delete a scheduled job
- run: Show details about any run
- runs: List the runs of a job
- show: Show details of a scheduled job
- start: Starts the master scheduler as daemon in background
- stop: Stop the master scheduler daemon
- version: Show the version of the cli client

Each command can be asked for help using `--help'. The source and more
info is at https://github.com/eikek/pill.
#+end_example

Help for each command is offered with ~--help~:

#+begin_src shell :exports both :results verbatim
pill new --help
#+end_src

#+RESULTS:
#+begin_example
pill v0.0.1-SNAPSHOT

Schedule a new job

Usage: new [options] <program> [<args...>]

  --help                   Print this help
  -t, --timer <value>      The timer definition
  -m, --mail <value>       Mail addresses to notify with job output
  -em, --error-mail <value>
                           Mail addresses to notify about error output only
  --once <value>           Set the `once' flag of a job
  --silent <value>         Set the `silent' flag of a job
  --active <value>         Set the `active' flag on a job
  --keep <value>           How many of the last runs to keep
  --wd <value>             The job's working directory

Arguments:
  <program>                The script/program to run (required)
  <args...>                Arguments to the script
#+end_example

** Start the server

The rest server can be started by an extra command. Otherwise this
command is run automatically if no server is up.

#+begin_src shell :exports both
pill start
#+end_src

#+RESULTS:
: Starting server at 0.0.0.0:11350

** submit a job

#+begin_src shell :exports both :results verbatim
pill new --timer '2016-*-* *:0,30' ~/backup.sh arg1 arg2
#+end_src

#+RESULTS:
: Created 320458 running at 2016-*-* *:0,30.

The job id =320458= is used for other commands as argument.

** list scheduled jobs

#+begin_src shell :exports both :results verbatim
pill list
#+end_src

#+RESULTS:
: 320458         2016-*-* *:0,30	/home/eike/backup.sh

** show details of a job

#+begin_src shell :exports both :results verbatim
pill show 320458
#+end_src

#+RESULTS:
#+begin_example
{
  "id" : "320458",
  "job" : {
    "path" : "/home/eike/backup.sh",
    "params" : {
      "args" : [
        "arg1",
        "arg2"
      ],
      "env" : {

      },
      "cwd" : null
    }
  },
  "config" : {
    "timer" : "2016-*-* *:0,30",
    "mails" : [
    ],
    "errorMails" : [
    ],
    "runOnce" : false,
    "silent" : false,
    "active" : true
  }
}
#+end_example

** changing config of scheduled jobs

The options are the same as with ~new~. Properties are replaced with
those given to this command.

#+begin_src shell :exports both :results verbatim
pill change --timer '2016-*-* *:*' 320458
#+end_src

#+RESULTS:
: Updated.

** List job runs

#+begin_src shell :exports both :results verbatim
pill runs 320458
#+end_src

#+RESULTS:
: 320458             1   rc=  0  runtime=PT10.007S

Here the job has been run once with exit code 0 and it took 10
seconds.

** Show details of a job run

#+begin_src shell :exports both :results verbatim
pill last 320458
#+end_src

#+RESULTS:
: --------------------------------------------------------------------------------
: Job: 320458
: Run: 2
: Return code: 0
: Startet: 2016-11-20T00:02:08.923Z
: Runtime: PT10.007S
: Silent: false
: -------------------------------------stdout-------------------------------------
: hello world!

The ~last~ command gets details about the last run. This is the second run.

** Show output of any run

#+begin_src shell :exports both :results verbatim
pill run -n 1 320458
#+end_src

#+RESULTS:
: --------------------------------------------------------------------------------
: Job: 320458
: Run: 1
: Return code: 0
: Startet: 2016-11-20T00:01:08.923Z
: Runtime: PT10.007S
: Silent: false
: -------------------------------------stdout-------------------------------------
: hello world!

** cleanup runs

If the number of output gets too much, you can delete them by keeping
the latest ~x~ entries.

#+begin_src shell :exports both :results verbatim
pill clean-runs --keep 2 320458
#+end_src

#+RESULTS:
: {
:   "deleted" : 0
: }

** remove a scheduled job

Deletes the job and its runs:

#+begin_src shell :exports both :results verbatim
pill rm 320458
#+end_src

#+RESULTS:
: Deleted job 320458

** print some info

The ~info~ command prints information from the master job (the server).

#+begin_src shell :exports both :results verbatim
pill info
#+end_src

#+RESULTS:
#+begin_example
Endpoint: http://0.0.0.0:11350/api
{
  "running" : true,
  "active" : true,
  "started" : "2016-11-19T23:22:08.915Z",
  "hostname" : "ithaka.home",
  "runningJobs" : [
  ],
  "buildInfo" : {
    "projectName" : "pill",
    "commit" : "dirty workingdir @ master/04dd29dfa",
    "buildTime" : "2016-11-19T22:59:37.108Z",
    "version" : "0.0.1-SNAPSHOT",
    "homepage" : "https://github.com/eikek/pill"
  }
}
#+end_example

** Pause all

The master job can be paused.

#+begin_src shell :exports both :results verbatim
pill pause --active false
#+end_src

#+RESULTS:
: {
:   "active" : true
: }

It prints the old state.
